let items = [
    {
        name: 'H9',
        title: 'Анализатор гемоглобина Lifotromic  H9',
        description: 'С учётом сложившейся международной обстановки, существующая теория предполагает независимые способы реализации экономической целесообразности принимаемых решений. ',
        image: '..//images/h9.svg'
    },
    {
        name: 'H8',
        title: 'Анализатор гемоглобина Lifotromic  H8',
        description: 'Полностью автоматизированный анализатор гемоглобина H8 сообщает результат HbA1c за 130 секунд с распознаванием вариантов гемоглобина, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Без пробоподготовки и безоперационной работы. Образцы с вариантами гемоглобина могут быть подвергнуты углубленному анализу в рамках программы β-талассемии.',
        image: '..//images/h8.svg'
    },
    {
        name: 'H100',
        title: 'Анализатор гемоглобина Lifotromic  H100',
        description: 'Полностью автоматизированный анализатор гемоглобина H100 использует аналитическую технику ВЭЖХ, которая является золотым стандартом обнаружения HbA1c. Он может давать результат HbA1c за 96 секунд без распознавания вариантов Hb, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Образцы с вариантами гемоглобина могут быть проанализированы простым изменением режима на программу β-Thalassemia.',
        image: '..//images/h100.svg',
    },
    {
        name: 'ECL8000',
        title: 'Анализатор гемоглобина Lifotromic  ECL8000',
        description: 'eCL 8000 — это полностью автоматизированный анализатор с производительностью 86 Т/ч, основанный на самом передовом электрохемилюминесцентном иммуноанализе (ECLIA). Доступно более 90 параметров, охватывающих щитовидную железу, фертильность, опухоль, сердце, воспаление, маркер костного метаболизма и т. д.',
        image: '..//images/ecl8000.png'
    },
    {
        name: 'GH-900+',
        title: 'Анализатор HbA1c  GH-900PLUS',
        description: 'Полностью автоматизированный анализатор HbA1c GH-900Plus сообщает результат HbA1c за 130 секунд с распознаванием вариантов Hb. Он обеспечивает выдающееся решение для надежного мониторинга диабета.',
        image: '..//images/gh-900plus.png'
    },
    {
        name: 'AC610',
        title: 'Гематологический анализатор на 5 частей  AC610',
        description: 'AC610 — это автоматический гематологический анализатор на 5 частей с компактными размерами и усовершенствованной конструкцией, предназначенный для малых и средних диагностических лабораторий, больниц и клиник, с более низкими эксплуатационными расходами, более удобным управлением и экономичным бюджетом.',
        image: '..//images/ac-160.png'
    },
    {
        name: 'ECL9000',
        title: 'Автоматизированный иммуноанализатор  ECL9000',
        description: 'eCL 9000 — это полностью автоматизированный анализатор производительностью 300 т/ч, основанный на самом передовом электрохемилюминесцентном иммуноанализе (ECLIA). Доступно более 90 параметров, охватывающих щитовидную железу, фертильность, опухоль, сердце, воспаление, маркер костного метаболизма и т. д.',
        image: '..//images/ecl9000.png'
    },
    {
        name: 'FA-160',
        title: 'Иммунофлуоресцентный анализатор  FA-160',
        description: 'Lifotronic FA-160 основан на технологии иммунофлуоресценции, которая позволяет количественно определять аналиты в образцах для диагностики кардиологических, инфекционных и многих других заболеваний.',
        image: '..//images/fa-160.png'
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'H8',
        title: 'Анализатор гемоглобина Lifotromic  H8',
        description: 'Полностью автоматизированный анализатор гемоглобина H8 сообщает результат HbA1c за 130 секунд с распознаванием вариантов гемоглобина, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Без пробоподготовки и безоперационной работы. Образцы с вариантами гемоглобина могут быть подвергнуты углубленному анализу в рамках программы β-талассемии.',
        image: '..//images/h8.svg'
    },
    {
        name: 'H100',
        title: 'Анализатор гемоглобина Lifotromic  H100',
        description: 'Полностью автоматизированный анализатор гемоглобина H100 использует аналитическую технику ВЭЖХ, которая является золотым стандартом обнаружения HbA1c. Он может давать результат HbA1c за 96 секунд без распознавания вариантов Hb, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Образцы с вариантами гемоглобина могут быть проанализированы простым изменением режима на программу β-Thalassemia.',
        image: '..//images/h100.svg',
    },
    {
        name: 'H100',
        title: 'Анализатор гемоглобина Lifotromic  H100',
        description: 'Полностью автоматизированный анализатор гемоглобина H100 использует аналитическую технику ВЭЖХ, которая является золотым стандартом обнаружения HbA1c. Он может давать результат HbA1c за 96 секунд без распознавания вариантов Hb, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Образцы с вариантами гемоглобина могут быть проанализированы простым изменением режима на программу β-Thalassemia.',
        image: '..//images/h100.svg',
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'H9',
        title: 'Анализатор гемоглобина Lifotromic  H9',
        description: 'С учётом сложившейся международной обстановки, существующая теория предполагает независимые способы реализации экономической целесообразности принимаемых решений. ',
        image: '..//images/h9.svg'
    },
    {
        name: 'H8',
        title: 'Анализатор гемоглобина Lifotromic  H8',
        description: 'Полностью автоматизированный анализатор гемоглобина H8 сообщает результат HbA1c за 130 секунд с распознаванием вариантов гемоглобина, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Без пробоподготовки и безоперационной работы. Образцы с вариантами гемоглобина могут быть подвергнуты углубленному анализу в рамках программы β-талассемии.',
        image: '..//images/h8.svg'
    },
    {
        name: 'H100',
        title: 'Анализатор гемоглобина Lifotromic  H100',
        description: 'Полностью автоматизированный анализатор гемоглобина H100 использует аналитическую технику ВЭЖХ, которая является золотым стандартом обнаружения HbA1c. Он может давать результат HbA1c за 96 секунд без распознавания вариантов Hb, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Образцы с вариантами гемоглобина могут быть проанализированы простым изменением режима на программу β-Thalassemia.',
        image: '..//images/h100.svg',
    },
    {
        name: 'H9',
        title: 'Анализатор гемоглобина Lifotromic  H9',
        description: 'С учётом сложившейся международной обстановки, существующая теория предполагает независимые способы реализации экономической целесообразности принимаемых решений. ',
        image: '..//images/h9.svg'
    },
    {
        name: 'H8',
        title: 'Анализатор гемоглобина Lifotromic  H8',
        description: 'Полностью автоматизированный анализатор гемоглобина H8 сообщает результат HbA1c за 130 секунд с распознаванием вариантов гемоглобина, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Без пробоподготовки и безоперационной работы. Образцы с вариантами гемоглобина могут быть подвергнуты углубленному анализу в рамках программы β-талассемии.',
        image: '..//images/h8.svg'
    },
    {
        name: 'H100',
        title: 'Анализатор гемоглобина Lifotromic  H100',
        description: 'Полностью автоматизированный анализатор гемоглобина H100 использует аналитическую технику ВЭЖХ, которая является золотым стандартом обнаружения HbA1c. Он может давать результат HbA1c за 96 секунд без распознавания вариантов Hb, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Образцы с вариантами гемоглобина могут быть проанализированы простым изменением режима на программу β-Thalassemia.',
        image: '..//images/h100.svg',
    }, {
        name: 'H9',
        title: 'Анализатор гемоглобина Lifotromic  H9',
        description: 'С учётом сложившейся международной обстановки, существующая теория предполагает независимые способы реализации экономической целесообразности принимаемых решений. ',
        image: '..//images/h9.svg'
    },
    {
        name: 'H8',
        title: 'Анализатор гемоглобина Lifotromic  H8',
        description: 'Полностью автоматизированный анализатор гемоглобина H8 сообщает результат HbA1c за 130 секунд с распознаванием вариантов гемоглобина, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Без пробоподготовки и безоперационной работы. Образцы с вариантами гемоглобина могут быть подвергнуты углубленному анализу в рамках программы β-талассемии.',
        image: '..//images/h8.svg'
    },
    {
        name: 'H100',
        title: 'Анализатор гемоглобина Lifotromic  H100',
        description: 'Полностью автоматизированный анализатор гемоглобина H100 использует аналитическую технику ВЭЖХ, которая является золотым стандартом обнаружения HbA1c. Он может давать результат HbA1c за 96 секунд без распознавания вариантов Hb, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Образцы с вариантами гемоглобина могут быть проанализированы простым изменением режима на программу β-Thalassemia.',
        image: '..//images/h100.svg',
    },
    {
        name: 'ECL8000',
        title: 'Анализатор гемоглобина Lifotromic  ECL8000',
        description: 'eCL 8000 — это полностью автоматизированный анализатор с производительностью 86 Т/ч, основанный на самом передовом электрохемилюминесцентном иммуноанализе (ECLIA). Доступно более 90 параметров, охватывающих щитовидную железу, фертильность, опухоль, сердце, воспаление, маркер костного метаболизма и т. д.',
        image: '..//images/ecl8000.png'
    },
    {
        name: 'GH-900+',
        title: 'Анализатор HbA1c  GH-900PLUS',
        description: 'Полностью автоматизированный анализатор HbA1c GH-900Plus сообщает результат HbA1c за 130 секунд с распознаванием вариантов Hb. Он обеспечивает выдающееся решение для надежного мониторинга диабета.',
        image: '..//images/gh-900plus.png'
    },
    {
        name: 'AC610',
        title: 'Гематологический анализатор на 5 частей  AC610',
        description: 'AC610 — это автоматический гематологический анализатор на 5 частей с компактными размерами и усовершенствованной конструкцией, предназначенный для малых и средних диагностических лабораторий, больниц и клиник, с более низкими эксплуатационными расходами, более удобным управлением и экономичным бюджетом.',
        image: '..//images/ac-160.png'
    },
    {
        name: 'ECL9000',
        title: 'Автоматизированный иммуноанализатор  ECL9000',
        description: 'eCL 9000 — это полностью автоматизированный анализатор производительностью 300 т/ч, основанный на самом передовом электрохемилюминесцентном иммуноанализе (ECLIA). Доступно более 90 параметров, охватывающих щитовидную железу, фертильность, опухоль, сердце, воспаление, маркер костного метаболизма и т. д.',
        image: '..//images/ecl9000.png'
    },
    {
        name: 'FA-160',
        title: 'Иммунофлуоресцентный анализатор  FA-160',
        description: 'Lifotronic FA-160 основан на технологии иммунофлуоресценции, которая позволяет количественно определять аналиты в образцах для диагностики кардиологических, инфекционных и многих других заболеваний.',
        image: '..//images/fa-160.png'
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'H8',
        title: 'Анализатор гемоглобина Lifotromic  H8',
        description: 'Полностью автоматизированный анализатор гемоглобина H8 сообщает результат HbA1c за 130 секунд с распознаванием вариантов гемоглобина, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Без пробоподготовки и безоперационной работы. Образцы с вариантами гемоглобина могут быть подвергнуты углубленному анализу в рамках программы β-талассемии.',
        image: '..//images/h8.svg'
    },
    {
        name: 'H100',
        title: 'Анализатор гемоглобина Lifotromic  H100',
        description: 'Полностью автоматизированный анализатор гемоглобина H100 использует аналитическую технику ВЭЖХ, которая является золотым стандартом обнаружения HbA1c. Он может давать результат HbA1c за 96 секунд без распознавания вариантов Hb, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Образцы с вариантами гемоглобина могут быть проанализированы простым изменением режима на программу β-Thalassemia.',
        image: '..//images/h100.svg',
    },
    {
        name: 'H100',
        title: 'Анализатор гемоглобина Lifotromic  H100',
        description: 'Полностью автоматизированный анализатор гемоглобина H100 использует аналитическую технику ВЭЖХ, которая является золотым стандартом обнаружения HbA1c. Он может давать результат HbA1c за 96 секунд без распознавания вариантов Hb, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Образцы с вариантами гемоглобина могут быть проанализированы простым изменением режима на программу β-Thalassemia.',
        image: '..//images/h100.svg',
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'H9',
        title: 'Анализатор гемоглобина Lifotromic  H9',
        description: 'С учётом сложившейся международной обстановки, существующая теория предполагает независимые способы реализации экономической целесообразности принимаемых решений. ',
        image: '..//images/h9.svg'
    },
    {
        name: 'H8',
        title: 'Анализатор гемоглобина Lifotromic  H8',
        description: 'Полностью автоматизированный анализатор гемоглобина H8 сообщает результат HbA1c за 130 секунд с распознаванием вариантов гемоглобина, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Без пробоподготовки и безоперационной работы. Образцы с вариантами гемоглобина могут быть подвергнуты углубленному анализу в рамках программы β-талассемии.',
        image: '..//images/h8.svg'
    },
    {
        name: 'H100',
        title: 'Анализатор гемоглобина Lifotromic  H100',
        description: 'Полностью автоматизированный анализатор гемоглобина H100 использует аналитическую технику ВЭЖХ, которая является золотым стандартом обнаружения HbA1c. Он может давать результат HbA1c за 96 секунд без распознавания вариантов Hb, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Образцы с вариантами гемоглобина могут быть проанализированы простым изменением режима на программу β-Thalassemia.',
        image: '..//images/h100.svg',
    },
    {
        name: 'H9',
        title: 'Анализатор гемоглобина Lifotromic  H9',
        description: 'С учётом сложившейся международной обстановки, существующая теория предполагает независимые способы реализации экономической целесообразности принимаемых решений. ',
        image: '..//images/h9.svg'
    },
    {
        name: 'H8',
        title: 'Анализатор гемоглобина Lifotromic  H8',
        description: 'Полностью автоматизированный анализатор гемоглобина H8 сообщает результат HbA1c за 130 секунд с распознаванием вариантов гемоглобина, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Без пробоподготовки и безоперационной работы. Образцы с вариантами гемоглобина могут быть подвергнуты углубленному анализу в рамках программы β-талассемии.',
        image: '..//images/h8.svg'
    },
    {
        name: 'H100',
        title: 'Анализатор гемоглобина Lifotromic  H100',
        description: 'Полностью автоматизированный анализатор гемоглобина H100 использует аналитическую технику ВЭЖХ, которая является золотым стандартом обнаружения HbA1c. Он может давать результат HbA1c за 96 секунд без распознавания вариантов Hb, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Образцы с вариантами гемоглобина могут быть проанализированы простым изменением режима на программу β-Thalassemia.',
        image: '..//images/h100.svg',
    }, {
        name: 'H9',
        title: 'Анализатор гемоглобина Lifotromic  H9',
        description: 'С учётом сложившейся международной обстановки, существующая теория предполагает независимые способы реализации экономической целесообразности принимаемых решений. ',
        image: '..//images/h9.svg'
    },
    {
        name: 'H8',
        title: 'Анализатор гемоглобина Lifotromic  H8',
        description: 'Полностью автоматизированный анализатор гемоглобина H8 сообщает результат HbA1c за 130 секунд с распознаванием вариантов гемоглобина, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Без пробоподготовки и безоперационной работы. Образцы с вариантами гемоглобина могут быть подвергнуты углубленному анализу в рамках программы β-талассемии.',
        image: '..//images/h8.svg'
    },
    {
        name: 'H100',
        title: 'Анализатор гемоглобина Lifotromic  H100',
        description: 'Полностью автоматизированный анализатор гемоглобина H100 использует аналитическую технику ВЭЖХ, которая является золотым стандартом обнаружения HbA1c. Он может давать результат HbA1c за 96 секунд без распознавания вариантов Hb, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Образцы с вариантами гемоглобина могут быть проанализированы простым изменением режима на программу β-Thalassemia.',
        image: '..//images/h100.svg',
    },
    {
        name: 'ECL8000',
        title: 'Анализатор гемоглобина Lifotromic  ECL8000',
        description: 'eCL 8000 — это полностью автоматизированный анализатор с производительностью 86 Т/ч, основанный на самом передовом электрохемилюминесцентном иммуноанализе (ECLIA). Доступно более 90 параметров, охватывающих щитовидную железу, фертильность, опухоль, сердце, воспаление, маркер костного метаболизма и т. д.',
        image: '..//images/ecl8000.png'
    },
    {
        name: 'GH-900+',
        title: 'Анализатор HbA1c  GH-900PLUS',
        description: 'Полностью автоматизированный анализатор HbA1c GH-900Plus сообщает результат HbA1c за 130 секунд с распознаванием вариантов Hb. Он обеспечивает выдающееся решение для надежного мониторинга диабета.',
        image: '..//images/gh-900plus.png'
    },
    {
        name: 'AC610',
        title: 'Гематологический анализатор на 5 частей  AC610',
        description: 'AC610 — это автоматический гематологический анализатор на 5 частей с компактными размерами и усовершенствованной конструкцией, предназначенный для малых и средних диагностических лабораторий, больниц и клиник, с более низкими эксплуатационными расходами, более удобным управлением и экономичным бюджетом.',
        image: '..//images/ac-160.png'
    },
    {
        name: 'ECL9000',
        title: 'Автоматизированный иммуноанализатор  ECL9000',
        description: 'eCL 9000 — это полностью автоматизированный анализатор производительностью 300 т/ч, основанный на самом передовом электрохемилюминесцентном иммуноанализе (ECLIA). Доступно более 90 параметров, охватывающих щитовидную железу, фертильность, опухоль, сердце, воспаление, маркер костного метаболизма и т. д.',
        image: '..//images/ecl9000.png'
    },
    {
        name: 'FA-160',
        title: 'Иммунофлуоресцентный анализатор  FA-160',
        description: 'Lifotronic FA-160 основан на технологии иммунофлуоресценции, которая позволяет количественно определять аналиты в образцах для диагностики кардиологических, инфекционных и многих других заболеваний.',
        image: '..//images/fa-160.png'
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'H8',
        title: 'Анализатор гемоглобина Lifotromic  H8',
        description: 'Полностью автоматизированный анализатор гемоглобина H8 сообщает результат HbA1c за 130 секунд с распознаванием вариантов гемоглобина, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Без пробоподготовки и безоперационной работы. Образцы с вариантами гемоглобина могут быть подвергнуты углубленному анализу в рамках программы β-талассемии.',
        image: '..//images/h8.svg'
    },
    {
        name: 'H100',
        title: 'Анализатор гемоглобина Lifotromic  H100',
        description: 'Полностью автоматизированный анализатор гемоглобина H100 использует аналитическую технику ВЭЖХ, которая является золотым стандартом обнаружения HbA1c. Он может давать результат HbA1c за 96 секунд без распознавания вариантов Hb, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Образцы с вариантами гемоглобина могут быть проанализированы простым изменением режима на программу β-Thalassemia.',
        image: '..//images/h100.svg',
    },
    {
        name: 'H100',
        title: 'Анализатор гемоглобина Lifotromic  H100',
        description: 'Полностью автоматизированный анализатор гемоглобина H100 использует аналитическую технику ВЭЖХ, которая является золотым стандартом обнаружения HbA1c. Он может давать результат HbA1c за 96 секунд без распознавания вариантов Hb, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Образцы с вариантами гемоглобина могут быть проанализированы простым изменением режима на программу β-Thalassemia.',
        image: '..//images/h100.svg',
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'COVID-19',
        title: 'Экспресс тест на антитела от коронавируса  SARS CoV-2',
        description: 'Rapid test, или экспресс тест на коронавирус — это общее название нескольких быстрых методов определения заболевания. Тест является быстрой альтернативой ПЦР, не требующий лабораторного оборудования и специальных условий проведения.',
        image: '..//images/rapid-covid-test.png'
    },
    {
        name: 'H9',
        title: 'Анализатор гемоглобина Lifotromic  H9',
        description: 'С учётом сложившейся международной обстановки, существующая теория предполагает независимые способы реализации экономической целесообразности принимаемых решений. ',
        image: '..//images/h9.svg'
    },
    {
        name: 'H8',
        title: 'Анализатор гемоглобина Lifotromic  H8',
        description: 'Полностью автоматизированный анализатор гемоглобина H8 сообщает результат HbA1c за 130 секунд с распознаванием вариантов гемоглобина, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Без пробоподготовки и безоперационной работы. Образцы с вариантами гемоглобина могут быть подвергнуты углубленному анализу в рамках программы β-талассемии.',
        image: '..//images/h8.svg'
    },
    {
        name: 'H100',
        title: 'Анализатор гемоглобина Lifotromic  H100',
        description: 'Полностью автоматизированный анализатор гемоглобина H100 использует аналитическую технику ВЭЖХ, которая является золотым стандартом обнаружения HbA1c. Он может давать результат HbA1c за 96 секунд без распознавания вариантов Hb, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Образцы с вариантами гемоглобина могут быть проанализированы простым изменением режима на программу β-Thalassemia.',
        image: '..//images/h100.svg',
    },
    {
        name: 'H9',
        title: 'Анализатор гемоглобина Lifotromic  H9',
        description: 'С учётом сложившейся международной обстановки, существующая теория предполагает независимые способы реализации экономической целесообразности принимаемых решений. ',
        image: '..//images/h9.svg'
    },
    {
        name: 'H8',
        title: 'Анализатор гемоглобина Lifotromic  H8',
        description: 'Полностью автоматизированный анализатор гемоглобина H8 сообщает результат HbA1c за 130 секунд с распознаванием вариантов гемоглобина, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Без пробоподготовки и безоперационной работы. Образцы с вариантами гемоглобина могут быть подвергнуты углубленному анализу в рамках программы β-талассемии.',
        image: '..//images/h8.svg'
    },
    {
        name: 'H100',
        title: 'Анализатор гемоглобина Lifotromic  H100',
        description: 'Полностью автоматизированный анализатор гемоглобина H100 использует аналитическую технику ВЭЖХ, которая является золотым стандартом обнаружения HbA1c. Он может давать результат HbA1c за 96 секунд без распознавания вариантов Hb, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Образцы с вариантами гемоглобина могут быть проанализированы простым изменением режима на программу β-Thalassemia.',
        image: '..//images/h100.svg',
    },{
        name: 'H8',
        title: 'Анализатор гемоглобина Lifotromic  H8',
        description: 'Полностью автоматизированный анализатор гемоглобина H8 сообщает результат HbA1c за 130 секунд с распознаванием вариантов гемоглобина, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Без пробоподготовки и безоперационной работы. Образцы с вариантами гемоглобина могут быть подвергнуты углубленному анализу в рамках программы β-талассемии.',
        image: '..//images/h8.svg'
    },
    {
        name: 'H100',
        title: 'Анализатор гемоглобина Lifotromic  H100',
        description: 'Полностью автоматизированный анализатор гемоглобина H100 использует аналитическую технику ВЭЖХ, которая является золотым стандартом обнаружения HbA1c. Он может давать результат HbA1c за 96 секунд без распознавания вариантов Hb, обеспечивая выдающееся решение для быстрого и надежного мониторинга диабета. Образцы с вариантами гемоглобина могут быть проанализированы простым изменением режима на программу β-Thalassemia.',
        image: '..//images/h100.svg',
    },
]
document.querySelector('.catalogue').addEventListener('mouseover', ()=>{
    document.querySelector('.additional-list').style.display = 'flex'
})
document.querySelector('.products').addEventListener('mouseover', ()=>{
    document.querySelector('.inner-list').style.display = 'flex'
})
document.querySelector('section').addEventListener('mouseover', ()=>{
    document.querySelector('.additional-list').style.display = 'none'
    document.querySelector('.inner-list').style.display = 'none'
    document.querySelector('.search-input').style.display = 'none'
    document.querySelector('.search-input').value = ''
    document.querySelector('.search-img').src = '..//images/search.svg'
    document.querySelector('.tel-number').style.display = 'block'
    document.querySelector('.search-img').style.position = 'unset'
})
document.querySelector('.search-img').addEventListener('mouseover', ()=>{
    document.querySelector('.tel-number').style.display = 'none'
    document.querySelector('.search-block').style.gap = '0'
    document.querySelector('.search-img').src = '..//images/search-red.png'
    document.querySelector('.search-img').style.position = 'absolute'
    document.querySelector('.search-input').style.display = 'block'
})
document.querySelector('.search-img').addEventListener('click', ()=>{
    document.querySelector('.search-input').value = ''
})
let menuBtn = document.querySelector('.menu-btn');
let l1 = document.querySelector('.l1');
let l2 = document.querySelector('.l2');
let l3 = document.querySelector('.l3');
let menuOpen = false;
menuBtn.addEventListener('click', () => {
  if(!menuOpen) {
    menuBtn.classList.add('open');
    menuOpen = true;
    document.querySelector('.btn-line').style.position = 'absolute'
    menuBtn.style.gap = '0'
    l1.style.rotate = '45deg'
    l2.style.opacity = '0'
    l3.style.rotate = '-45deg'
    document.querySelector('.btn-line').style.transition = '300ms'
    document.querySelector('.header-media').style.display = 'flex'
  } else {
    menuBtn.classList.remove('open');
    document.querySelector('.btn-line').style.position = 'unset'
    menuOpen = false;
    menuBtn.style.gap = '6px'
    l1.style.rotate = '0deg'
    l2.style.opacity = '1'
    l3.style.rotate = '0deg'
    l1.style.marginTop = '0'
    document.querySelector('.header-media').style.display = 'none'
    }
});

var acc = document.getElementsByClassName("accordion");
var i;
for (i = 0; i < acc.length; i++) {
    acc[i].addEventListener("click", function() {
    /* Toggle between adding and removing the "active" class,
    to highlight the button that controls the panel */
    this.classList.toggle("active");

    /* Toggle between hiding and showing the active panel */
    var panel = document.querySelector('.panel')
    if (panel.style.display === "block") {
        panel.style.display = "none";
    } else {
        panel.style.display = "block";
    }
  });
}



let block = document.querySelector(".goods");
let pagination = document.querySelector(".pagination");
let prevPage = document.querySelector(".prev");
let nextPage = document.querySelector(".next");
let notesOnPage = 6;

let countOfItems = Math.ceil(items.length / notesOnPage);

items.forEach((card) => {
    let cardElement = document.createElement('div');
    cardElement.classList.add('good-card');
    function removeLastWord(str) {
        let words = str.split(' ');
        words.pop();
        return words.join(' ');
    }
    card.title = removeLastWord(card.title)
})

let paginationItem = [];
for (let i = 1; i <= countOfItems; i++) {
  let li = document.createElement("li");
  li.classList.add("pagination__item");
  pagination.appendChild(li);
  let span = document.createElement("span");
  span.innerHTML = i;
  li.appendChild(span);
  paginationItem.push(span);
}
let active;
showPage(paginationItem[0]);
for (let item of paginationItem) {
  item.addEventListener("click", function() {
    showPage(this);
  });
}

function showPage(item) {
  if (active) {
    active.classList.remove("_active");
  }
  active = item;
  item.classList.add("_active");

  let pageNum = +item.innerHTML;

  let start = (pageNum - 1) * notesOnPage;
  let end = start + notesOnPage;
  let notes = items.slice(start, end);

  block.innerHTML = "";
  for (let note of notes) {
    block.insertAdjacentHTML("beforeend",
      `
    <div class="good-card">
    <img class="" src="${note.image}" alt="">
        <h3>${note.name}</h3>
        <p>${note.title}</p>
    </div>
    `
    );
  }
  hideOverPages();
}

prevPage.addEventListener("click", function() {
  if (active.parentElement.previousElementSibling) {
    showPage(active.parentElement.previousElementSibling.querySelector("span"));
  }
});
nextPage.addEventListener("click", function() {
  if (active.parentElement.nextElementSibling) {
    showPage(active.parentElement.nextElementSibling.querySelector("span"));
  }
});

/* Скрытие промежуточных номеров страниц */
function hideOverPages() {
  let items = [...pagination.children];
  if (items.length > 5) {
    items.forEach((item) => item.classList.add("_hide"));
    items[0].classList.remove("_hide");
    if (active.parentElement.previousElementSibling) {
      active.parentElement.previousElementSibling.classList.remove("_hide");
    }
    active.parentElement.classList.remove("_hide");
    if (active.parentElement.nextElementSibling) {
      active.parentElement.nextElementSibling.classList.remove("_hide");
    }
    items[items.length - 1].classList.remove("_hide");
  }
}